<?php
/* 02
다음은 배열을 이용하여 학생 10명('김**', '이**', '정**', '장**', '황**', '이**', '최**', '함**',
'도**', '강**'])의 5개 과목('파이썬', 'PHP', '자바스크립트', '사진', '영화감상')별 성적 합계와 평균
을 구하는 프로그램이다. 빈칸을 채워 프로그램을 완성하시오.
(출력 포맷, 예제 코드 생략...)
 */

$subject = ['파이썬', 'PHP', '자바스크립트', '사진', '영화감상'];
$name = ['김**', '이**', '정**', '장**', '황**', '이**', '최**', '함**', '도**', '강**'];

$score = [
  [80, 79, 90, 89, 100, 87, 85, 83, 96, 99],
  [70, 88, 70, 85, 60, 95, 77, 89, 82, 93],
  [80, 79, 90, 89, 100, 87, 85, 83, 96, 99],
  [70, 88, 70, 85, 60, 95, 77, 89, 82, 93],
  [85, 66, 80, 88, 90, 86, 85, 93, 88, 79],
];

for ($i = 0; $i < count($score); $i++) {
  $sum = 0;
  for ($j = 0; $j < count($score[$i]); $j++) {
    $sum += $score[$i][$j];
  }
  $avg = $sum / count($score[$i]);
  echo "{$subject[$i]}의 합계: $sum, 평균: $avg <br>";
}
