<?php
/* 03
2번 문제의 학생별로 5개 과목의 성적 합계와 평균을 구하는 프로그램을 작성하시오.
(출력 포맷 생략...)
 */

$subject = ["파이썬", "PHP", "자바스크립트", "사진", "영화감상"];
$name = ["김**", "이**", "정**", "장**", "황**", "이**", "최**", "함**", "도**", "강**"];

$score = [
  [80, 79, 90, 89, 100, 87, 85, 83, 96, 99],
  [70, 88, 70, 85, 60, 95, 77, 89, 82, 93],
  [80, 79, 90, 89, 100, 87, 85, 83, 96, 99],
  [70, 88, 70, 85, 60, 95, 77, 89, 82, 93],
  [85, 66, 80, 88, 90, 86, 85, 93, 88, 79],
];

for ($i = 0; $i < count($score[0]); $i++) {
  $sum = 0;
  for ($j = 0; $j < count($score); $j++) {
    $sum += $score[$j][$i];
  }
  $avg = $sum / count($score);
  echo $name[$i].'의 합계: '.$sum.', 평균: '.$avg.'<br>';
}
