/* Q11
양의 정수를 입력하고 자릿수를 출력하는 프로그램을 작성하세요. 예를 들어 125를 입력하면
'그 수는 3자리 입니다.' 라고 출력하고, 1314를 입력하면 '그 수는 4자리 입니다.' 라고
출력하면 됩니다.
*/
#include <stdio.h>

int main() {

    int n;

    do {
        printf("정수를 입력하세요: ");
        scanf("%d", &n);
        if (n <= 0)
            printf("0보다 큰 수을 입력하세요!\n");
    } while(n <= 0);

    if (n >= 1 && n <= 9)
        printf("그 수는 1자리 입니다.\n");
    else if (n >= 10 && n <= 99)
        printf("그 수는 2자리 입니다.\n");
    else if (n >= 100 && n <= 999)
        printf("그 수는 3자리 입니다.\n");
    else if (n >= 1000 && n <= 9999)
        printf("그 수는 4자리 입니다.\n");
    else if (n >= 10000 && n <= 99999)
        printf("그 수는 5자리 입니다.\n");
    else if (n >= 100000 && n <= 999999)
        printf("그 수는 6자리 입니다.\n");

    return 0;
}
